grevaillot/svd_tools/headers/ATSAMV71Q21B/pioc.h
/** @defgroup pioc_pio_odsr PIOODSR Output Data Status Register
@{*/

/** PIOC_PIO_ODSR_P31 Output Data Status **/
#define PIOC_PIO_ODSR_P31		(1 << 31)
/** PIOC_PIO_ODSR_P30 Output Data Status **/
#define PIOC_PIO_ODSR_P30		(1 << 30)
/** PIOC_PIO_ODSR_P29 Output Data Status **/
#define PIOC_PIO_ODSR_P29		(1 << 29)
/** PIOC_PIO_ODSR_P28 Output Data Status **/
#define PIOC_PIO_ODSR_P28		(1 << 28)
/** PIOC_PIO_ODSR_P27 Output Data Status **/
#define PIOC_PIO_ODSR_P27		(1 << 27)
/** PIOC_PIO_ODSR_P26 Output Data Status **/
#define PIOC_PIO_ODSR_P26		(1 << 26)
/** PIOC_PIO_ODSR_P25 Output Data Status **/
#define PIOC_PIO_ODSR_P25		(1 << 25)
/** PIOC_PIO_ODSR_P24 Output Data Status **/
#define PIOC_PIO_ODSR_P24		(1 << 24)
/** PIOC_PIO_ODSR_P23 Output Data Status **/
#define PIOC_PIO_ODSR_P23		(1 << 23)
/** PIOC_PIO_ODSR_P22 Output Data Status **/
#define PIOC_PIO_ODSR_P22		(1 << 22)
/** PIOC_PIO_ODSR_P21 Output Data Status **/
#define PIOC_PIO_ODSR_P21		(1 << 21)
/** PIOC_PIO_ODSR_P20 Output Data Status **/
#define PIOC_PIO_ODSR_P20		(1 << 20)
/** PIOC_PIO_ODSR_P19 Output Data Status **/
#define PIOC_PIO_ODSR_P19		(1 << 19)
/** PIOC_PIO_ODSR_P18 Output Data Status **/
#define PIOC_PIO_ODSR_P18		(1 << 18)
/** PIOC_PIO_ODSR_P17 Output Data Status **/
#define PIOC_PIO_ODSR_P17		(1 << 17)
/** PIOC_PIO_ODSR_P16 Output Data Status **/
#define PIOC_PIO_ODSR_P16		(1 << 16)
/** PIOC_PIO_ODSR_P15 Output Data Status **/
#define PIOC_PIO_ODSR_P15		(1 << 15)
/** PIOC_PIO_ODSR_P14 Output Data Status **/
#define PIOC_PIO_ODSR_P14		(1 << 14)
/** PIOC_PIO_ODSR_P13 Output Data Status **/
#define PIOC_PIO_ODSR_P13		(1 << 13)
/** PIOC_PIO_ODSR_P12 Output Data Status **/
#define PIOC_PIO_ODSR_P12		(1 << 12)
/** PIOC_PIO_ODSR_P11 Output Data Status **/
#define PIOC_PIO_ODSR_P11		(1 << 11)
/** PIOC_PIO_ODSR_P10 Output Data Status **/
#define PIOC_PIO_ODSR_P10		(1 << 10)
/** PIOC_PIO_ODSR_P9 Output Data Status **/
#define PIOC_PIO_ODSR_P9		(1 << 9)
/** PIOC_PIO_ODSR_P8 Output Data Status **/
#define PIOC_PIO_ODSR_P8		(1 << 8)
/** PIOC_PIO_ODSR_P7 Output Data Status **/
#define PIOC_PIO_ODSR_P7		(1 << 7)
/** PIOC_PIO_ODSR_P6 Output Data Status **/
#define PIOC_PIO_ODSR_P6		(1 << 6)
/** PIOC_PIO_ODSR_P5 Output Data Status **/
#define PIOC_PIO_ODSR_P5		(1 << 5)
/** PIOC_PIO_ODSR_P4 Output Data Status **/
#define PIOC_PIO_ODSR_P4		(1 << 4)
/** PIOC_PIO_ODSR_P3 Output Data Status **/
#define PIOC_PIO_ODSR_P3		(1 << 3)
/** PIOC_PIO_ODSR_P2 Output Data Status **/
#define PIOC_PIO_ODSR_P2		(1 << 2)
/** PIOC_PIO_ODSR_P1 Output Data Status **/
#define PIOC_PIO_ODSR_P1		(1 << 1)
/** PIOC_PIO_ODSR_P0 Output Data Status **/
#define PIOC_PIO_ODSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_pio_pdsr PIOPDSR Pin Data Status Register
@{*/

/** PIOC_PIO_PDSR_P31 Output Data Status **/
#define PIOC_PIO_PDSR_P31		(1 << 31)
/** PIOC_PIO_PDSR_P30 Output Data Status **/
#define PIOC_PIO_PDSR_P30		(1 << 30)
/** PIOC_PIO_PDSR_P29 Output Data Status **/
#define PIOC_PIO_PDSR_P29		(1 << 29)
/** PIOC_PIO_PDSR_P28 Output Data Status **/
#define PIOC_PIO_PDSR_P28		(1 << 28)
/** PIOC_PIO_PDSR_P27 Output Data Status **/
#define PIOC_PIO_PDSR_P27		(1 << 27)
/** PIOC_PIO_PDSR_P26 Output Data Status **/
#define PIOC_PIO_PDSR_P26		(1 << 26)
/** PIOC_PIO_PDSR_P25 Output Data Status **/
#define PIOC_PIO_PDSR_P25		(1 << 25)
/** PIOC_PIO_PDSR_P24 Output Data Status **/
#define PIOC_PIO_PDSR_P24		(1 << 24)
/** PIOC_PIO_PDSR_P23 Output Data Status **/
#define PIOC_PIO_PDSR_P23		(1 << 23)
/** PIOC_PIO_PDSR_P22 Output Data Status **/
#define PIOC_PIO_PDSR_P22		(1 << 22)
/** PIOC_PIO_PDSR_P21 Output Data Status **/
#define PIOC_PIO_PDSR_P21		(1 << 21)
/** PIOC_PIO_PDSR_P20 Output Data Status **/
#define PIOC_PIO_PDSR_P20		(1 << 20)
/** PIOC_PIO_PDSR_P19 Output Data Status **/
#define PIOC_PIO_PDSR_P19		(1 << 19)
/** PIOC_PIO_PDSR_P18 Output Data Status **/
#define PIOC_PIO_PDSR_P18		(1 << 18)
/** PIOC_PIO_PDSR_P17 Output Data Status **/
#define PIOC_PIO_PDSR_P17		(1 << 17)
/** PIOC_PIO_PDSR_P16 Output Data Status **/
#define PIOC_PIO_PDSR_P16		(1 << 16)
/** PIOC_PIO_PDSR_P15 Output Data Status **/
#define PIOC_PIO_PDSR_P15		(1 << 15)
/** PIOC_PIO_PDSR_P14 Output Data Status **/
#define PIOC_PIO_PDSR_P14		(1 << 14)
/** PIOC_PIO_PDSR_P13 Output Data Status **/
#define PIOC_PIO_PDSR_P13		(1 << 13)
/** PIOC_PIO_PDSR_P12 Output Data Status **/
#define PIOC_PIO_PDSR_P12		(1 << 12)
/** PIOC_PIO_PDSR_P11 Output Data Status **/
#define PIOC_PIO_PDSR_P11		(1 << 11)
/** PIOC_PIO_PDSR_P10 Output Data Status **/
#define PIOC_PIO_PDSR_P10		(1 << 10)
/** PIOC_PIO_PDSR_P9 Output Data Status **/
#define PIOC_PIO_PDSR_P9		(1 << 9)
/** PIOC_PIO_PDSR_P8 Output Data Status **/
#define PIOC_PIO_PDSR_P8		(1 << 8)
/** PIOC_PIO_PDSR_P7 Output Data Status **/
#define PIOC_PIO_PDSR_P7		(1 << 7)
/** PIOC_PIO_PDSR_P6 Output Data Status **/
#define PIOC_PIO_PDSR_P6		(1 << 6)
/** PIOC_PIO_PDSR_P5 Output Data Status **/
#define PIOC_PIO_PDSR_P5		(1 << 5)
/** PIOC_PIO_PDSR_P4 Output Data Status **/
#define PIOC_PIO_PDSR_P4		(1 << 4)
/** PIOC_PIO_PDSR_P3 Output Data Status **/
#define PIOC_PIO_PDSR_P3		(1 << 3)
/** PIOC_PIO_PDSR_P2 Output Data Status **/
#define PIOC_PIO_PDSR_P2		(1 << 2)
/** PIOC_PIO_PDSR_P1 Output Data Status **/
#define PIOC_PIO_PDSR_P1		(1 << 1)
/** PIOC_PIO_PDSR_P0 Output Data Status **/
#define PIOC_PIO_PDSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_pio_ier PIOIER Interrupt Enable Register
@{*/

/** PIOC_PIO_IER_P31 Input Change Interrupt Enable **/
#define PIOC_PIO_IER_P31		(1 << 31)
/** PIOC_PIO_IER_P30 Input Change Interrupt Enable **/
#define PIOC_PIO_IER_P30		(1 << 30)
/** PIOC_PIO_IER_P29 Input Change Interrupt Enable **/
#define PIOC_PIO_IER_P29		(1 << 29)
/** PIOC_PIO_IER_P28 Input Change Interrupt Enable **/
#define PIOC_PIO_IER_P28		(1 << 28)
/** PIOC_PIO_IER_P27 Input Change Interrupt Enable **/
#define PIOC_PIO_IER_P27		(1 << 27)
/** PIOC_PIO_IER_P26 Input Change Interrupt Enable **/
#define PIOC_PIO_IER_P26		(1 << 26)
/** PIOC_PIO_IER_P25 Input Change Interrupt Enable **/
#define PIOC_PIO_IER_P25		(1 << 25)
/** PIOC_PIO_IER_P24 Input Change Interrupt Enable **/
#define PIOC_PIO_IER_P24		(1 << 24)
/** PIOC_PIO_IER_P23 Input Change Interrupt Enable **/
#define PIOC_PIO_IER_P23		(1 << 23)
/** PIOC_PIO_IER_P22 Input Change Interrupt Enable **/
#define PIOC_PIO_IER_P22		(1 << 22)
/** PIOC_PIO_IER_P21 Input Change Interrupt Enable **/
#define PIOC_PIO_IER_P21		(1 << 21)
/** PIOC_PIO_IER_P20 Input Change Interrupt Enable **/
#define PIOC_PIO_IER_P20		(1 << 20)
/** PIOC_PIO_IER_P19 Input Change Interrupt Enable **/
#define PIOC_PIO_IER_P19		(1 << 19)
/** PIOC_PIO_IER_P18 Input Change Interrupt Enable **/
#define PIOC_PIO_IER_P18		(1 << 18)
/** PIOC_PIO_IER_P17 Input Change Interrupt Enable **/
#define PIOC_PIO_IER_P17		(1 << 17)
/** PIOC_PIO_IER_P16 Input Change Interrupt Enable **/
#define PIOC_PIO_IER_P16		(1 << 16)
/** PIOC_PIO_IER_P15 Input Change Interrupt Enable **/
#define PIOC_PIO_IER_P15		(1 << 15)
/** PIOC_PIO_IER_P14 Input Change Interrupt Enable **/
#define PIOC_PIO_IER_P14		(1 << 14)
/** PIOC_PIO_IER_P13 Input Change Interrupt Enable **/
#define PIOC_PIO_IER_P13		(1 << 13)
/** PIOC_PIO_IER_P12 Input Change Interrupt Enable **/
#define PIOC_PIO_IER_P12		(1 << 12)
/** PIOC_PIO_IER_P11 Input Change Interrupt Enable **/
#define PIOC_PIO_IER_P11		(1 << 11)
/** PIOC_PIO_IER_P10 Input Change Interrupt Enable **/
#define PIOC_PIO_IER_P10		(1 << 10)
/** PIOC_PIO_IER_P9 Input Change Interrupt Enable **/
#define PIOC_PIO_IER_P9		(1 << 9)
/** PIOC_PIO_IER_P8 Input Change Interrupt Enable **/
#define PIOC_PIO_IER_P8		(1 << 8)
/** PIOC_PIO_IER_P7 Input Change Interrupt Enable **/
#define PIOC_PIO_IER_P7		(1 << 7)
/** PIOC_PIO_IER_P6 Input Change Interrupt Enable **/
#define PIOC_PIO_IER_P6		(1 << 6)
/** PIOC_PIO_IER_P5 Input Change Interrupt Enable **/
#define PIOC_PIO_IER_P5		(1 << 5)
/** PIOC_PIO_IER_P4 Input Change Interrupt Enable **/
#define PIOC_PIO_IER_P4		(1 << 4)
/** PIOC_PIO_IER_P3 Input Change Interrupt Enable **/
#define PIOC_PIO_IER_P3		(1 << 3)
/** PIOC_PIO_IER_P2 Input Change Interrupt Enable **/
#define PIOC_PIO_IER_P2		(1 << 2)
/** PIOC_PIO_IER_P1 Input Change Interrupt Enable **/
#define PIOC_PIO_IER_P1		(1 << 1)
/** PIOC_PIO_IER_P0 Input Change Interrupt Enable **/
#define PIOC_PIO_IER_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_pio_idr PIOIDR Interrupt Disable Register
@{*/

/** PIOC_PIO_IDR_P31 Input Change Interrupt Disable **/
#define PIOC_PIO_IDR_P31		(1 << 31)
/** PIOC_PIO_IDR_P30 Input Change Interrupt Disable **/
#define PIOC_PIO_IDR_P30		(1 << 30)
/** PIOC_PIO_IDR_P29 Input Change Interrupt Disable **/
#define PIOC_PIO_IDR_P29		(1 << 29)
/** PIOC_PIO_IDR_P28 Input Change Interrupt Disable **/
#define PIOC_PIO_IDR_P28		(1 << 28)
/** PIOC_PIO_IDR_P27 Input Change Interrupt Disable **/
#define PIOC_PIO_IDR_P27		(1 << 27)
/** PIOC_PIO_IDR_P26 Input Change Interrupt Disable **/
#define PIOC_PIO_IDR_P26		(1 << 26)
/** PIOC_PIO_IDR_P25 Input Change Interrupt Disable **/
#define PIOC_PIO_IDR_P25		(1 << 25)
/** PIOC_PIO_IDR_P24 Input Change Interrupt Disable **/
#define PIOC_PIO_IDR_P24		(1 << 24)
/** PIOC_PIO_IDR_P23 Input Change Interrupt Disable **/
#define PIOC_PIO_IDR_P23		(1 << 23)
/** PIOC_PIO_IDR_P22 Input Change Interrupt Disable **/
#define PIOC_PIO_IDR_P22		(1 << 22)
/** PIOC_PIO_IDR_P21 Input Change Interrupt Disable **/
#define PIOC_PIO_IDR_P21		(1 << 21)
/** PIOC_PIO_IDR_P20 Input Change Interrupt Disable **/
#define PIOC_PIO_IDR_P20		(1 << 20)
/** PIOC_PIO_IDR_P19 Input Change Interrupt Disable **/
#define PIOC_PIO_IDR_P19		(1 << 19)
/** PIOC_PIO_IDR_P18 Input Change Interrupt Disable **/
#define PIOC_PIO_IDR_P18		(1 << 18)
/** PIOC_PIO_IDR_P17 Input Change Interrupt Disable **/
#define PIOC_PIO_IDR_P17		(1 << 17)
/** PIOC_PIO_IDR_P16 Input Change Interrupt Disable **/
#define PIOC_PIO_IDR_P16		(1 << 16)
/** PIOC_PIO_IDR_P15 Input Change Interrupt Disable **/
#define PIOC_PIO_IDR_P15		(1 << 15)
/** PIOC_PIO_IDR_P14 Input Change Interrupt Disable **/
#define PIOC_PIO_IDR_P14		(1 << 14)
/** PIOC_PIO_IDR_P13 Input Change Interrupt Disable **/
#define PIOC_PIO_IDR_P13		(1 << 13)
/** PIOC_PIO_IDR_P12 Input Change Interrupt Disable **/
#define PIOC_PIO_IDR_P12		(1 << 12)
/** PIOC_PIO_IDR_P11 Input Change Interrupt Disable **/
#define PIOC_PIO_IDR_P11		(1 << 11)
/** PIOC_PIO_IDR_P10 Input Change Interrupt Disable **/
#define PIOC_PIO_IDR_P10		(1 << 10)
/** PIOC_PIO_IDR_P9 Input Change Interrupt Disable **/
#define PIOC_PIO_IDR_P9		(1 << 9)
/** PIOC_PIO_IDR_P8 Input Change Interrupt Disable **/
#define PIOC_PIO_IDR_P8		(1 << 8)
/** PIOC_PIO_IDR_P7 Input Change Interrupt Disable **/
#define PIOC_PIO_IDR_P7		(1 << 7)
/** PIOC_PIO_IDR_P6 Input Change Interrupt Disable **/
#define PIOC_PIO_IDR_P6		(1 << 6)
/** PIOC_PIO_IDR_P5 Input Change Interrupt Disable **/
#define PIOC_PIO_IDR_P5		(1 << 5)
/** PIOC_PIO_IDR_P4 Input Change Interrupt Disable **/
#define PIOC_PIO_IDR_P4		(1 << 4)
/** PIOC_PIO_IDR_P3 Input Change Interrupt Disable **/
#define PIOC_PIO_IDR_P3		(1 << 3)
/** PIOC_PIO_IDR_P2 Input Change Interrupt Disable **/
#define PIOC_PIO_IDR_P2		(1 << 2)
/** PIOC_PIO_IDR_P1 Input Change Interrupt Disable **/
#define PIOC_PIO_IDR_P1		(1 << 1)
/** PIOC_PIO_IDR_P0 Input Change Interrupt Disable **/
#define PIOC_PIO_IDR_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_pio_imr PIOIMR Interrupt Mask Register
@{*/

/** PIOC_PIO_IMR_P31 Input Change Interrupt Mask **/
#define PIOC_PIO_IMR_P31		(1 << 31)
/** PIOC_PIO_IMR_P30 Input Change Interrupt Mask **/
#define PIOC_PIO_IMR_P30		(1 << 30)
/** PIOC_PIO_IMR_P29 Input Change Interrupt Mask **/
#define PIOC_PIO_IMR_P29		(1 << 29)
/** PIOC_PIO_IMR_P28 Input Change Interrupt Mask **/
#define PIOC_PIO_IMR_P28		(1 << 28)
/** PIOC_PIO_IMR_P27 Input Change Interrupt Mask **/
#define PIOC_PIO_IMR_P27		(1 << 27)
/** PIOC_PIO_IMR_P26 Input Change Interrupt Mask **/
#define PIOC_PIO_IMR_P26		(1 << 26)
/** PIOC_PIO_IMR_P25 Input Change Interrupt Mask **/
#define PIOC_PIO_IMR_P25		(1 << 25)
/** PIOC_PIO_IMR_P24 Input Change Interrupt Mask **/
#define PIOC_PIO_IMR_P24		(1 << 24)
/** PIOC_PIO_IMR_P23 Input Change Interrupt Mask **/
#define PIOC_PIO_IMR_P23		(1 << 23)
/** PIOC_PIO_IMR_P22 Input Change Interrupt Mask **/
#define PIOC_PIO_IMR_P22		(1 << 22)
/** PIOC_PIO_IMR_P21 Input Change Interrupt Mask **/
#define PIOC_PIO_IMR_P21		(1 << 21)
/** PIOC_PIO_IMR_P20 Input Change Interrupt Mask **/
#define PIOC_PIO_IMR_P20		(1 << 20)
/** PIOC_PIO_IMR_P19 Input Change Interrupt Mask **/
#define PIOC_PIO_IMR_P19		(1 << 19)
/** PIOC_PIO_IMR_P18 Input Change Interrupt Mask **/
#define PIOC_PIO_IMR_P18		(1 << 18)
/** PIOC_PIO_IMR_P17 Input Change Interrupt Mask **/
#define PIOC_PIO_IMR_P17		(1 << 17)
/** PIOC_PIO_IMR_P16 Input Change Interrupt Mask **/
#define PIOC_PIO_IMR_P16		(1 << 16)
/** PIOC_PIO_IMR_P15 Input Change Interrupt Mask **/
#define PIOC_PIO_IMR_P15		(1 << 15)
/** PIOC_PIO_IMR_P14 Input Change Interrupt Mask **/
#define PIOC_PIO_IMR_P14		(1 << 14)
/** PIOC_PIO_IMR_P13 Input Change Interrupt Mask **/
#define PIOC_PIO_IMR_P13		(1 << 13)
/** PIOC_PIO_IMR_P12 Input Change Interrupt Mask **/
#define PIOC_PIO_IMR_P12		(1 << 12)
/** PIOC_PIO_IMR_P11 Input Change Interrupt Mask **/
#define PIOC_PIO_IMR_P11		(1 << 11)
/** PIOC_PIO_IMR_P10 Input Change Interrupt Mask **/
#define PIOC_PIO_IMR_P10		(1 << 10)
/** PIOC_PIO_IMR_P9 Input Change Interrupt Mask **/
#define PIOC_PIO_IMR_P9		(1 << 9)
/** PIOC_PIO_IMR_P8 Input Change Interrupt Mask **/
#define PIOC_PIO_IMR_P8		(1 << 8)
/** PIOC_PIO_IMR_P7 Input Change Interrupt Mask **/
#define PIOC_PIO_IMR_P7		(1 << 7)
/** PIOC_PIO_IMR_P6 Input Change Interrupt Mask **/
#define PIOC_PIO_IMR_P6		(1 << 6)
/** PIOC_PIO_IMR_P5 Input Change Interrupt Mask **/
#define PIOC_PIO_IMR_P5		(1 << 5)
/** PIOC_PIO_IMR_P4 Input Change Interrupt Mask **/
#define PIOC_PIO_IMR_P4		(1 << 4)
/** PIOC_PIO_IMR_P3 Input Change Interrupt Mask **/
#define PIOC_PIO_IMR_P3		(1 << 3)
/** PIOC_PIO_IMR_P2 Input Change Interrupt Mask **/
#define PIOC_PIO_IMR_P2		(1 << 2)
/** PIOC_PIO_IMR_P1 Input Change Interrupt Mask **/
#define PIOC_PIO_IMR_P1		(1 << 1)
/** PIOC_PIO_IMR_P0 Input Change Interrupt Mask **/
#define PIOC_PIO_IMR_P0		(1 << 0)

/**@}*/

