grevaillot/svd_tools/headers/ATSAMV71Q21B/pioc.h
/** PIOC_PIO_AIMDR_P31 Additional Interrupt Modes Disable **/
#define PIOC_PIO_AIMDR_P31		(1 << 31)
/** PIOC_PIO_AIMDR_P30 Additional Interrupt Modes Disable **/
#define PIOC_PIO_AIMDR_P30		(1 << 30)
/** PIOC_PIO_AIMDR_P29 Additional Interrupt Modes Disable **/
#define PIOC_PIO_AIMDR_P29		(1 << 29)
/** PIOC_PIO_AIMDR_P28 Additional Interrupt Modes Disable **/
#define PIOC_PIO_AIMDR_P28		(1 << 28)
/** PIOC_PIO_AIMDR_P27 Additional Interrupt Modes Disable **/
#define PIOC_PIO_AIMDR_P27		(1 << 27)
/** PIOC_PIO_AIMDR_P26 Additional Interrupt Modes Disable **/
#define PIOC_PIO_AIMDR_P26		(1 << 26)
/** PIOC_PIO_AIMDR_P25 Additional Interrupt Modes Disable **/
#define PIOC_PIO_AIMDR_P25		(1 << 25)
/** PIOC_PIO_AIMDR_P24 Additional Interrupt Modes Disable **/
#define PIOC_PIO_AIMDR_P24		(1 << 24)
/** PIOC_PIO_AIMDR_P23 Additional Interrupt Modes Disable **/
#define PIOC_PIO_AIMDR_P23		(1 << 23)
/** PIOC_PIO_AIMDR_P22 Additional Interrupt Modes Disable **/
#define PIOC_PIO_AIMDR_P22		(1 << 22)
/** PIOC_PIO_AIMDR_P21 Additional Interrupt Modes Disable **/
#define PIOC_PIO_AIMDR_P21		(1 << 21)
/** PIOC_PIO_AIMDR_P20 Additional Interrupt Modes Disable **/
#define PIOC_PIO_AIMDR_P20		(1 << 20)
/** PIOC_PIO_AIMDR_P19 Additional Interrupt Modes Disable **/
#define PIOC_PIO_AIMDR_P19		(1 << 19)
/** PIOC_PIO_AIMDR_P18 Additional Interrupt Modes Disable **/
#define PIOC_PIO_AIMDR_P18		(1 << 18)
/** PIOC_PIO_AIMDR_P17 Additional Interrupt Modes Disable **/
#define PIOC_PIO_AIMDR_P17		(1 << 17)
/** PIOC_PIO_AIMDR_P16 Additional Interrupt Modes Disable **/
#define PIOC_PIO_AIMDR_P16		(1 << 16)
/** PIOC_PIO_AIMDR_P15 Additional Interrupt Modes Disable **/
#define PIOC_PIO_AIMDR_P15		(1 << 15)
/** PIOC_PIO_AIMDR_P14 Additional Interrupt Modes Disable **/
#define PIOC_PIO_AIMDR_P14		(1 << 14)
/** PIOC_PIO_AIMDR_P13 Additional Interrupt Modes Disable **/
#define PIOC_PIO_AIMDR_P13		(1 << 13)
/** PIOC_PIO_AIMDR_P12 Additional Interrupt Modes Disable **/
#define PIOC_PIO_AIMDR_P12		(1 << 12)
/** PIOC_PIO_AIMDR_P11 Additional Interrupt Modes Disable **/
#define PIOC_PIO_AIMDR_P11		(1 << 11)
/** PIOC_PIO_AIMDR_P10 Additional Interrupt Modes Disable **/
#define PIOC_PIO_AIMDR_P10		(1 << 10)
/** PIOC_PIO_AIMDR_P9 Additional Interrupt Modes Disable **/
#define PIOC_PIO_AIMDR_P9		(1 << 9)
/** PIOC_PIO_AIMDR_P8 Additional Interrupt Modes Disable **/
#define PIOC_PIO_AIMDR_P8		(1 << 8)
/** PIOC_PIO_AIMDR_P7 Additional Interrupt Modes Disable **/
#define PIOC_PIO_AIMDR_P7		(1 << 7)
/** PIOC_PIO_AIMDR_P6 Additional Interrupt Modes Disable **/
#define PIOC_PIO_AIMDR_P6		(1 << 6)
/** PIOC_PIO_AIMDR_P5 Additional Interrupt Modes Disable **/
#define PIOC_PIO_AIMDR_P5		(1 << 5)
/** PIOC_PIO_AIMDR_P4 Additional Interrupt Modes Disable **/
#define PIOC_PIO_AIMDR_P4		(1 << 4)
/** PIOC_PIO_AIMDR_P3 Additional Interrupt Modes Disable **/
#define PIOC_PIO_AIMDR_P3		(1 << 3)
/** PIOC_PIO_AIMDR_P2 Additional Interrupt Modes Disable **/
#define PIOC_PIO_AIMDR_P2		(1 << 2)
/** PIOC_PIO_AIMDR_P1 Additional Interrupt Modes Disable **/
#define PIOC_PIO_AIMDR_P1		(1 << 1)
/** PIOC_PIO_AIMDR_P0 Additional Interrupt Modes Disable **/
#define PIOC_PIO_AIMDR_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_pio_aimmr PIOAIMMR Additional Interrupt Modes Mask Register
@{*/

/** PIOC_PIO_AIMMR_P31 IO Line Index **/
#define PIOC_PIO_AIMMR_P31		(1 << 31)
/** PIOC_PIO_AIMMR_P30 IO Line Index **/
#define PIOC_PIO_AIMMR_P30		(1 << 30)
/** PIOC_PIO_AIMMR_P29 IO Line Index **/
#define PIOC_PIO_AIMMR_P29		(1 << 29)
/** PIOC_PIO_AIMMR_P28 IO Line Index **/
#define PIOC_PIO_AIMMR_P28		(1 << 28)
/** PIOC_PIO_AIMMR_P27 IO Line Index **/
#define PIOC_PIO_AIMMR_P27		(1 << 27)
/** PIOC_PIO_AIMMR_P26 IO Line Index **/
#define PIOC_PIO_AIMMR_P26		(1 << 26)
/** PIOC_PIO_AIMMR_P25 IO Line Index **/
#define PIOC_PIO_AIMMR_P25		(1 << 25)
/** PIOC_PIO_AIMMR_P24 IO Line Index **/
#define PIOC_PIO_AIMMR_P24		(1 << 24)
/** PIOC_PIO_AIMMR_P23 IO Line Index **/
#define PIOC_PIO_AIMMR_P23		(1 << 23)
/** PIOC_PIO_AIMMR_P22 IO Line Index **/
#define PIOC_PIO_AIMMR_P22		(1 << 22)
/** PIOC_PIO_AIMMR_P21 IO Line Index **/
#define PIOC_PIO_AIMMR_P21		(1 << 21)
/** PIOC_PIO_AIMMR_P20 IO Line Index **/
#define PIOC_PIO_AIMMR_P20		(1 << 20)
/** PIOC_PIO_AIMMR_P19 IO Line Index **/
#define PIOC_PIO_AIMMR_P19		(1 << 19)
/** PIOC_PIO_AIMMR_P18 IO Line Index **/
#define PIOC_PIO_AIMMR_P18		(1 << 18)
/** PIOC_PIO_AIMMR_P17 IO Line Index **/
#define PIOC_PIO_AIMMR_P17		(1 << 17)
/** PIOC_PIO_AIMMR_P16 IO Line Index **/
#define PIOC_PIO_AIMMR_P16		(1 << 16)
/** PIOC_PIO_AIMMR_P15 IO Line Index **/
#define PIOC_PIO_AIMMR_P15		(1 << 15)
/** PIOC_PIO_AIMMR_P14 IO Line Index **/
#define PIOC_PIO_AIMMR_P14		(1 << 14)
/** PIOC_PIO_AIMMR_P13 IO Line Index **/
#define PIOC_PIO_AIMMR_P13		(1 << 13)
/** PIOC_PIO_AIMMR_P12 IO Line Index **/
#define PIOC_PIO_AIMMR_P12		(1 << 12)
/** PIOC_PIO_AIMMR_P11 IO Line Index **/
#define PIOC_PIO_AIMMR_P11		(1 << 11)
/** PIOC_PIO_AIMMR_P10 IO Line Index **/
#define PIOC_PIO_AIMMR_P10		(1 << 10)
/** PIOC_PIO_AIMMR_P9 IO Line Index **/
#define PIOC_PIO_AIMMR_P9		(1 << 9)
/** PIOC_PIO_AIMMR_P8 IO Line Index **/
#define PIOC_PIO_AIMMR_P8		(1 << 8)
/** PIOC_PIO_AIMMR_P7 IO Line Index **/
#define PIOC_PIO_AIMMR_P7		(1 << 7)
/** PIOC_PIO_AIMMR_P6 IO Line Index **/
#define PIOC_PIO_AIMMR_P6		(1 << 6)
/** PIOC_PIO_AIMMR_P5 IO Line Index **/
#define PIOC_PIO_AIMMR_P5		(1 << 5)
/** PIOC_PIO_AIMMR_P4 IO Line Index **/
#define PIOC_PIO_AIMMR_P4		(1 << 4)
/** PIOC_PIO_AIMMR_P3 IO Line Index **/
#define PIOC_PIO_AIMMR_P3		(1 << 3)
/** PIOC_PIO_AIMMR_P2 IO Line Index **/
#define PIOC_PIO_AIMMR_P2		(1 << 2)
/** PIOC_PIO_AIMMR_P1 IO Line Index **/
#define PIOC_PIO_AIMMR_P1		(1 << 1)
/** PIOC_PIO_AIMMR_P0 IO Line Index **/
#define PIOC_PIO_AIMMR_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_pio_esr PIOESR Edge Select Register
@{*/

/** PIOC_PIO_ESR_P31 Edge Interrupt Selection **/
#define PIOC_PIO_ESR_P31		(1 << 31)
/** PIOC_PIO_ESR_P30 Edge Interrupt Selection **/
#define PIOC_PIO_ESR_P30		(1 << 30)
/** PIOC_PIO_ESR_P29 Edge Interrupt Selection **/
#define PIOC_PIO_ESR_P29		(1 << 29)
/** PIOC_PIO_ESR_P28 Edge Interrupt Selection **/
#define PIOC_PIO_ESR_P28		(1 << 28)
/** PIOC_PIO_ESR_P27 Edge Interrupt Selection **/
#define PIOC_PIO_ESR_P27		(1 << 27)
/** PIOC_PIO_ESR_P26 Edge Interrupt Selection **/
#define PIOC_PIO_ESR_P26		(1 << 26)
/** PIOC_PIO_ESR_P25 Edge Interrupt Selection **/
#define PIOC_PIO_ESR_P25		(1 << 25)
/** PIOC_PIO_ESR_P24 Edge Interrupt Selection **/
#define PIOC_PIO_ESR_P24		(1 << 24)
/** PIOC_PIO_ESR_P23 Edge Interrupt Selection **/
#define PIOC_PIO_ESR_P23		(1 << 23)
/** PIOC_PIO_ESR_P22 Edge Interrupt Selection **/
#define PIOC_PIO_ESR_P22		(1 << 22)
/** PIOC_PIO_ESR_P21 Edge Interrupt Selection **/
#define PIOC_PIO_ESR_P21		(1 << 21)
/** PIOC_PIO_ESR_P20 Edge Interrupt Selection **/
#define PIOC_PIO_ESR_P20		(1 << 20)
/** PIOC_PIO_ESR_P19 Edge Interrupt Selection **/
#define PIOC_PIO_ESR_P19		(1 << 19)
/** PIOC_PIO_ESR_P18 Edge Interrupt Selection **/
#define PIOC_PIO_ESR_P18		(1 << 18)
/** PIOC_PIO_ESR_P17 Edge Interrupt Selection **/
#define PIOC_PIO_ESR_P17		(1 << 17)
/** PIOC_PIO_ESR_P16 Edge Interrupt Selection **/
#define PIOC_PIO_ESR_P16		(1 << 16)
/** PIOC_PIO_ESR_P15 Edge Interrupt Selection **/
#define PIOC_PIO_ESR_P15		(1 << 15)
/** PIOC_PIO_ESR_P14 Edge Interrupt Selection **/
#define PIOC_PIO_ESR_P14		(1 << 14)
/** PIOC_PIO_ESR_P13 Edge Interrupt Selection **/
#define PIOC_PIO_ESR_P13		(1 << 13)
/** PIOC_PIO_ESR_P12 Edge Interrupt Selection **/
#define PIOC_PIO_ESR_P12		(1 << 12)
/** PIOC_PIO_ESR_P11 Edge Interrupt Selection **/
#define PIOC_PIO_ESR_P11		(1 << 11)
/** PIOC_PIO_ESR_P10 Edge Interrupt Selection **/
#define PIOC_PIO_ESR_P10		(1 << 10)
/** PIOC_PIO_ESR_P9 Edge Interrupt Selection **/
#define PIOC_PIO_ESR_P9		(1 << 9)
/** PIOC_PIO_ESR_P8 Edge Interrupt Selection **/
#define PIOC_PIO_ESR_P8		(1 << 8)
/** PIOC_PIO_ESR_P7 Edge Interrupt Selection **/
#define PIOC_PIO_ESR_P7		(1 << 7)
/** PIOC_PIO_ESR_P6 Edge Interrupt Selection **/
#define PIOC_PIO_ESR_P6		(1 << 6)
/** PIOC_PIO_ESR_P5 Edge Interrupt Selection **/
#define PIOC_PIO_ESR_P5		(1 << 5)
/** PIOC_PIO_ESR_P4 Edge Interrupt Selection **/
#define PIOC_PIO_ESR_P4		(1 << 4)
/** PIOC_PIO_ESR_P3 Edge Interrupt Selection **/
#define PIOC_PIO_ESR_P3		(1 << 3)
/** PIOC_PIO_ESR_P2 Edge Interrupt Selection **/
#define PIOC_PIO_ESR_P2		(1 << 2)
/** PIOC_PIO_ESR_P1 Edge Interrupt Selection **/
#define PIOC_PIO_ESR_P1		(1 << 1)
/** PIOC_PIO_ESR_P0 Edge Interrupt Selection **/
#define PIOC_PIO_ESR_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_pio_lsr PIOLSR Level Select Register
@{*/

/** PIOC_PIO_LSR_P31 Level Interrupt Selection **/
#define PIOC_PIO_LSR_P31		(1 << 31)
/** PIOC_PIO_LSR_P30 Level Interrupt Selection **/
#define PIOC_PIO_LSR_P30		(1 << 30)
/** PIOC_PIO_LSR_P29 Level Interrupt Selection **/
#define PIOC_PIO_LSR_P29		(1 << 29)
/** PIOC_PIO_LSR_P28 Level Interrupt Selection **/
#define PIOC_PIO_LSR_P28		(1 << 28)
/** PIOC_PIO_LSR_P27 Level Interrupt Selection **/
#define PIOC_PIO_LSR_P27		(1 << 27)
/** PIOC_PIO_LSR_P26 Level Interrupt Selection **/
#define PIOC_PIO_LSR_P26		(1 << 26)
/** PIOC_PIO_LSR_P25 Level Interrupt Selection **/
#define PIOC_PIO_LSR_P25		(1 << 25)
/** PIOC_PIO_LSR_P24 Level Interrupt Selection **/
#define PIOC_PIO_LSR_P24		(1 << 24)
/** PIOC_PIO_LSR_P23 Level Interrupt Selection **/
#define PIOC_PIO_LSR_P23		(1 << 23)
/** PIOC_PIO_LSR_P22 Level Interrupt Selection **/
#define PIOC_PIO_LSR_P22		(1 << 22)
/** PIOC_PIO_LSR_P21 Level Interrupt Selection **/
#define PIOC_PIO_LSR_P21		(1 << 21)
/** PIOC_PIO_LSR_P20 Level Interrupt Selection **/
#define PIOC_PIO_LSR_P20		(1 << 20)
/** PIOC_PIO_LSR_P19 Level Interrupt Selection **/
#define PIOC_PIO_LSR_P19		(1 << 19)
/** PIOC_PIO_LSR_P18 Level Interrupt Selection **/
#define PIOC_PIO_LSR_P18		(1 << 18)
/** PIOC_PIO_LSR_P17 Level Interrupt Selection **/
#define PIOC_PIO_LSR_P17		(1 << 17)
/** PIOC_PIO_LSR_P16 Level Interrupt Selection **/
#define PIOC_PIO_LSR_P16		(1 << 16)
/** PIOC_PIO_LSR_P15 Level Interrupt Selection **/
#define PIOC_PIO_LSR_P15		(1 << 15)
/** PIOC_PIO_LSR_P14 Level Interrupt Selection **/
#define PIOC_PIO_LSR_P14		(1 << 14)
/** PIOC_PIO_LSR_P13 Level Interrupt Selection **/
#define PIOC_PIO_LSR_P13		(1 << 13)
/** PIOC_PIO_LSR_P12 Level Interrupt Selection **/
#define PIOC_PIO_LSR_P12		(1 << 12)
/** PIOC_PIO_LSR_P11 Level Interrupt Selection **/
#define PIOC_PIO_LSR_P11		(1 << 11)
/** PIOC_PIO_LSR_P10 Level Interrupt Selection **/
#define PIOC_PIO_LSR_P10		(1 << 10)
/** PIOC_PIO_LSR_P9 Level Interrupt Selection **/
#define PIOC_PIO_LSR_P9		(1 << 9)
/** PIOC_PIO_LSR_P8 Level Interrupt Selection **/
#define PIOC_PIO_LSR_P8		(1 << 8)
/** PIOC_PIO_LSR_P7 Level Interrupt Selection **/
#define PIOC_PIO_LSR_P7		(1 << 7)
/** PIOC_PIO_LSR_P6 Level Interrupt Selection **/
#define PIOC_PIO_LSR_P6		(1 << 6)
/** PIOC_PIO_LSR_P5 Level Interrupt Selection **/
#define PIOC_PIO_LSR_P5		(1 << 5)
/** PIOC_PIO_LSR_P4 Level Interrupt Selection **/
#define PIOC_PIO_LSR_P4		(1 << 4)
/** PIOC_PIO_LSR_P3 Level Interrupt Selection **/
#define PIOC_PIO_LSR_P3		(1 << 3)
/** PIOC_PIO_LSR_P2 Level Interrupt Selection **/
#define PIOC_PIO_LSR_P2		(1 << 2)
/** PIOC_PIO_LSR_P1 Level Interrupt Selection **/
#define PIOC_PIO_LSR_P1		(1 << 1)
/** PIOC_PIO_LSR_P0 Level Interrupt Selection **/
#define PIOC_PIO_LSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_pio_elsr PIOELSR Edge/Level Status Register
@{*/

/** PIOC_PIO_ELSR_P31 Edge/Level Interrupt Source Selection **/
#define PIOC_PIO_ELSR_P31		(1 << 31)
/** PIOC_PIO_ELSR_P30 Edge/Level Interrupt Source Selection **/
#define PIOC_PIO_ELSR_P30		(1 << 30)
/** PIOC_PIO_ELSR_P29 Edge/Level Interrupt Source Selection **/
#define PIOC_PIO_ELSR_P29		(1 << 29)
/** PIOC_PIO_ELSR_P28 Edge/Level Interrupt Source Selection **/
#define PIOC_PIO_ELSR_P28		(1 << 28)
/** PIOC_PIO_ELSR_P27 Edge/Level Interrupt Source Selection **/
#define PIOC_PIO_ELSR_P27		(1 << 27)
/** PIOC_PIO_ELSR_P26 Edge/Level Interrupt Source Selection **/
#define PIOC_PIO_ELSR_P26		(1 << 26)
/** PIOC_PIO_ELSR_P25 Edge/Level Interrupt Source Selection **/
#define PIOC_PIO_ELSR_P25		(1 << 25)
/** PIOC_PIO_ELSR_P24 Edge/Level Interrupt Source Selection **/
#define PIOC_PIO_ELSR_P24		(1 << 24)
/** PIOC_PIO_ELSR_P23 Edge/Level Interrupt Source Selection **/
#define PIOC_PIO_ELSR_P23		(1 << 23)
/** PIOC_PIO_ELSR_P22 Edge/Level Interrupt Source Selection **/
#define PIOC_PIO_ELSR_P22		(1 << 22)
/** PIOC_PIO_ELSR_P21 Edge/Level Interrupt Source Selection **/
#define PIOC_PIO_ELSR_P21		(1 << 21)
/** PIOC_PIO_ELSR_P20 Edge/Level Interrupt Source Selection **/
#define PIOC_PIO_ELSR_P20		(1 << 20)
/** PIOC_PIO_ELSR_P19 Edge/Level Interrupt Source Selection **/
#define PIOC_PIO_ELSR_P19		(1 << 19)
/** PIOC_PIO_ELSR_P18 Edge/Level Interrupt Source Selection **/
#define PIOC_PIO_ELSR_P18		(1 << 18)
/** PIOC_PIO_ELSR_P17 Edge/Level Interrupt Source Selection **/
#define PIOC_PIO_ELSR_P17		(1 << 17)
/** PIOC_PIO_ELSR_P16 Edge/Level Interrupt Source Selection **/
#define PIOC_PIO_ELSR_P16		(1 << 16)
/** PIOC_PIO_ELSR_P15 Edge/Level Interrupt Source Selection **/
#define PIOC_PIO_ELSR_P15		(1 << 15)
/** PIOC_PIO_ELSR_P14 Edge/Level Interrupt Source Selection **/
#define PIOC_PIO_ELSR_P14		(1 << 14)
/** PIOC_PIO_ELSR_P13 Edge/Level Interrupt Source Selection **/
#define PIOC_PIO_ELSR_P13		(1 << 13)
/** PIOC_PIO_ELSR_P12 Edge/Level Interrupt Source Selection **/
#define PIOC_PIO_ELSR_P12		(1 << 12)
/** PIOC_PIO_ELSR_P11 Edge/Level Interrupt Source Selection **/
#define PIOC_PIO_ELSR_P11		(1 << 11)
/** PIOC_PIO_ELSR_P10 Edge/Level Interrupt Source Selection **/
#define PIOC_PIO_ELSR_P10		(1 << 10)
/** PIOC_PIO_ELSR_P9 Edge/Level Interrupt Source Selection **/
#define PIOC_PIO_ELSR_P9		(1 << 9)
/** PIOC_PIO_ELSR_P8 Edge/Level Interrupt Source Selection **/
#define PIOC_PIO_ELSR_P8		(1 << 8)
/** PIOC_PIO_ELSR_P7 Edge/Level Interrupt Source Selection **/
#define PIOC_PIO_ELSR_P7		(1 << 7)
/** PIOC_PIO_ELSR_P6 Edge/Level Interrupt Source Selection **/
#define PIOC_PIO_ELSR_P6		(1 << 6)
/** PIOC_PIO_ELSR_P5 Edge/Level Interrupt Source Selection **/
#define PIOC_PIO_ELSR_P5		(1 << 5)
/** PIOC_PIO_ELSR_P4 Edge/Level Interrupt Source Selection **/
#define PIOC_PIO_ELSR_P4		(1 << 4)
/** PIOC_PIO_ELSR_P3 Edge/Level Interrupt Source Selection **/
#define PIOC_PIO_ELSR_P3		(1 << 3)
/** PIOC_PIO_ELSR_P2 Edge/Level Interrupt Source Selection **/
#define PIOC_PIO_ELSR_P2		(1 << 2)
/** PIOC_PIO_ELSR_P1 Edge/Level Interrupt Source Selection **/
#define PIOC_PIO_ELSR_P1		(1 << 1)
/** PIOC_PIO_ELSR_P0 Edge/Level Interrupt Source Selection **/
#define PIOC_PIO_ELSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_pio_fellsr PIOFELLSR Falling Edge/Low-Level Select Register
@{*/

/** PIOC_PIO_FELLSR_P31 Falling Edge/Low-Level Interrupt Selection **/
#define PIOC_PIO_FELLSR_P31		(1 << 31)
/** PIOC_PIO_FELLSR_P30 Falling Edge/Low-Level Interrupt Selection **/
#define PIOC_PIO_FELLSR_P30		(1 << 30)
/** PIOC_PIO_FELLSR_P29 Falling Edge/Low-Level Interrupt Selection **/
#define PIOC_PIO_FELLSR_P29		(1 << 29)
/** PIOC_PIO_FELLSR_P28 Falling Edge/Low-Level Interrupt Selection **/
#define PIOC_PIO_FELLSR_P28		(1 << 28)
/** PIOC_PIO_FELLSR_P27 Falling Edge/Low-Level Interrupt Selection **/
#define PIOC_PIO_FELLSR_P27		(1 << 27)
/** PIOC_PIO_FELLSR_P26 Falling Edge/Low-Level Interrupt Selection **/
#define PIOC_PIO_FELLSR_P26		(1 << 26)
/** PIOC_PIO_FELLSR_P25 Falling Edge/Low-Level Interrupt Selection **/
#define PIOC_PIO_FELLSR_P25		(1 << 25)
/** PIOC_PIO_FELLSR_P24 Falling Edge/Low-Level Interrupt Selection **/
#define PIOC_PIO_FELLSR_P24		(1 << 24)
/** PIOC_PIO_FELLSR_P23 Falling Edge/Low-Level Interrupt Selection **/
#define PIOC_PIO_FELLSR_P23		(1 << 23)
/** PIOC_PIO_FELLSR_P22 Falling Edge/Low-Level Interrupt Selection **/
#define PIOC_PIO_FELLSR_P22		(1 << 22)
/** PIOC_PIO_FELLSR_P21 Falling Edge/Low-Level Interrupt Selection **/
#define PIOC_PIO_FELLSR_P21		(1 << 21)
/** PIOC_PIO_FELLSR_P20 Falling Edge/Low-Level Interrupt Selection **/
#define PIOC_PIO_FELLSR_P20		(1 << 20)
/** PIOC_PIO_FELLSR_P19 Falling Edge/Low-Level Interrupt Selection **/
#define PIOC_PIO_FELLSR_P19		(1 << 19)
/** PIOC_PIO_FELLSR_P18 Falling Edge/Low-Level Interrupt Selection **/
#define PIOC_PIO_FELLSR_P18		(1 << 18)
/** PIOC_PIO_FELLSR_P17 Falling Edge/Low-Level Interrupt Selection **/
#define PIOC_PIO_FELLSR_P17		(1 << 17)
/** PIOC_PIO_FELLSR_P16 Falling Edge/Low-Level Interrupt Selection **/
#define PIOC_PIO_FELLSR_P16		(1 << 16)
/** PIOC_PIO_FELLSR_P15 Falling Edge/Low-Level Interrupt Selection **/
#define PIOC_PIO_FELLSR_P15		(1 << 15)
/** PIOC_PIO_FELLSR_P14 Falling Edge/Low-Level Interrupt Selection **/
#define PIOC_PIO_FELLSR_P14		(1 << 14)
/** PIOC_PIO_FELLSR_P13 Falling Edge/Low-Level Interrupt Selection **/
#define PIOC_PIO_FELLSR_P13		(1 << 13)
/** PIOC_PIO_FELLSR_P12 Falling Edge/Low-Level Interrupt Selection **/
#define PIOC_PIO_FELLSR_P12		(1 << 12)
/** PIOC_PIO_FELLSR_P11 Falling Edge/Low-Level Interrupt Selection **/
#define PIOC_PIO_FELLSR_P11		(1 << 11)
/** PIOC_PIO_FELLSR_P10 Falling Edge/Low-Level Interrupt Selection **/
#define PIOC_PIO_FELLSR_P10		(1 << 10)
/** PIOC_PIO_FELLSR_P9 Falling Edge/Low-Level Interrupt Selection **/
#define PIOC_PIO_FELLSR_P9		(1 << 9)
/** PIOC_PIO_FELLSR_P8 Falling Edge/Low-Level Interrupt Selection **/
#define PIOC_PIO_FELLSR_P8		(1 << 8)
/** PIOC_PIO_FELLSR_P7 Falling Edge/Low-Level Interrupt Selection **/
#define PIOC_PIO_FELLSR_P7		(1 << 7)
/** PIOC_PIO_FELLSR_P6 Falling Edge/Low-Level Interrupt Selection **/
#define PIOC_PIO_FELLSR_P6		(1 << 6)
/** PIOC_PIO_FELLSR_P5 Falling Edge/Low-Level Interrupt Selection **/
#define PIOC_PIO_FELLSR_P5		(1 << 5)
/** PIOC_PIO_FELLSR_P4 Falling Edge/Low-Level Interrupt Selection **/
#define PIOC_PIO_FELLSR_P4		(1 << 4)
/** PIOC_PIO_FELLSR_P3 Falling Edge/Low-Level Interrupt Selection **/
#define PIOC_PIO_FELLSR_P3		(1 << 3)
/** PIOC_PIO_FELLSR_P2 Falling Edge/Low-Level Interrupt Selection **/
#define PIOC_PIO_FELLSR_P2		(1 << 2)
/** PIOC_PIO_FELLSR_P1 Falling Edge/Low-Level Interrupt Selection **/
#define PIOC_PIO_FELLSR_P1		(1 << 1)
/** PIOC_PIO_FELLSR_P0 Falling Edge/Low-Level Interrupt Selection **/
#define PIOC_PIO_FELLSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_pio_rehlsr PIOREHLSR Rising Edge/High-Level Select Register
@{*/

/** PIOC_PIO_REHLSR_P31 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_PIO_REHLSR_P31		(1 << 31)
/** PIOC_PIO_REHLSR_P30 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_PIO_REHLSR_P30		(1 << 30)
/** PIOC_PIO_REHLSR_P29 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_PIO_REHLSR_P29		(1 << 29)
/** PIOC_PIO_REHLSR_P28 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_PIO_REHLSR_P28		(1 << 28)
/** PIOC_PIO_REHLSR_P27 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_PIO_REHLSR_P27		(1 << 27)
/** PIOC_PIO_REHLSR_P26 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_PIO_REHLSR_P26		(1 << 26)
/** PIOC_PIO_REHLSR_P25 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_PIO_REHLSR_P25		(1 << 25)
/** PIOC_PIO_REHLSR_P24 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_PIO_REHLSR_P24		(1 << 24)
/** PIOC_PIO_REHLSR_P23 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_PIO_REHLSR_P23		(1 << 23)
/** PIOC_PIO_REHLSR_P22 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_PIO_REHLSR_P22		(1 << 22)
/** PIOC_PIO_REHLSR_P21 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_PIO_REHLSR_P21		(1 << 21)
/** PIOC_PIO_REHLSR_P20 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_PIO_REHLSR_P20		(1 << 20)
/** PIOC_PIO_REHLSR_P19 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_PIO_REHLSR_P19		(1 << 19)
/** PIOC_PIO_REHLSR_P18 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_PIO_REHLSR_P18		(1 << 18)
/** PIOC_PIO_REHLSR_P17 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_PIO_REHLSR_P17		(1 << 17)
/** PIOC_PIO_REHLSR_P16 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_PIO_REHLSR_P16		(1 << 16)
/** PIOC_PIO_REHLSR_P15 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_PIO_REHLSR_P15		(1 << 15)
/** PIOC_PIO_REHLSR_P14 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_PIO_REHLSR_P14		(1 << 14)
/** PIOC_PIO_REHLSR_P13 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_PIO_REHLSR_P13		(1 << 13)
/** PIOC_PIO_REHLSR_P12 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_PIO_REHLSR_P12		(1 << 12)
/** PIOC_PIO_REHLSR_P11 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_PIO_REHLSR_P11		(1 << 11)
/** PIOC_PIO_REHLSR_P10 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_PIO_REHLSR_P10		(1 << 10)
/** PIOC_PIO_REHLSR_P9 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_PIO_REHLSR_P9		(1 << 9)
/** PIOC_PIO_REHLSR_P8 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_PIO_REHLSR_P8		(1 << 8)
/** PIOC_PIO_REHLSR_P7 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_PIO_REHLSR_P7		(1 << 7)
/** PIOC_PIO_REHLSR_P6 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_PIO_REHLSR_P6		(1 << 6)
/** PIOC_PIO_REHLSR_P5 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_PIO_REHLSR_P5		(1 << 5)
/** PIOC_PIO_REHLSR_P4 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_PIO_REHLSR_P4		(1 << 4)
/** PIOC_PIO_REHLSR_P3 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_PIO_REHLSR_P3		(1 << 3)
/** PIOC_PIO_REHLSR_P2 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_PIO_REHLSR_P2		(1 << 2)
/** PIOC_PIO_REHLSR_P1 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_PIO_REHLSR_P1		(1 << 1)
/** PIOC_PIO_REHLSR_P0 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_PIO_REHLSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_pio_frlhsr PIOFRLHSR Fall/Rise - Low/High Status Register
@{*/

